[
    {
        "exerciseName": "JUMPING JACKS",
        "URL" : "https://www.youtube.com/watch?v=2W4ZNSwoW_4&list=PLoVy-85EFtK899UosmFY3vviTqy4s47-q",
        "thumbnail" : "https://thumbs.dreamstime.com/b/basic-rgb-236988584.jpg",
        "duration": 20,
        "repition": 0,
        "instructions": "Start with your feet together and your arms by your sides, then jump up with your feet apart and your hands overhead.\\n\\n Return to the start position then do the next rep. This exercise provides a full-body workout and works all your large muscle groups.",
        "focus_area": [
            "Shoulders",
            "Quadriceps",
            "Adductors",
            "Glutes",
            "Calves",
            "Chest"
        ],
        "common_mistakes": [
            "When you jump in the air and come down, you are putting too much impact or pressure on your feet, ankles, knees or other joints, this can lead to discomfort or injury. Try to land the balls of your feet rather than your heels.It absorbs more shock.",
            "Failing to keep the knees bent can cause the exercise to be less effective.",
            "It requires the core muscles to be engaged throughout the entire exercise. If the core is not engaged, it can lead to poor form and an ineffective workout."
        ],
        "breathing_tips": [
            "Inhale as you jump your feet apart.",
            "exhale as you jump your feet back together.",
            "Take deep breaths to fully oxygenate your body."
        ]
    },
    {
        "exerciseName": "INCLINE PUSH-UPS",
        "thumbnail" : "https://www.lyfta.app/_next/image?url=%2Fthumbnails%2F37851201.jpg&w=1920&q=20",
        "URL":"https://www.youtube.com/watch?v=3WUUeM07i_Q",
        "duration": 0,
        "repition": 16,
        "instructions": "Start in the regular push-up position but with your hands elevated on a chair or bench.\\n\\nThen push your body up down using your arm strength.\\n\\nRemember to keep your body straight.",
        "focus_area": [
            "Chest",
            "Shoulders",
            "Triceps"
        ],
        "common_mistakes": [
            "Placing your hands too wide or too close together can put unnecessary strain on your wrists and elbows. Keep your hands shoulder-width apart and directly under shoulders.",
            "Allowing your back to sag or lifting your hips too high during Push-ups can put undue stress on your spine and increase the risk of injury. Keep your body in a straight line from head to heels.",
            "It requires the core muscles to be engaged throughout the entire exercise. If the core is not engaged, it can lead to poor form and an ineffective workout.",
            "This places unnecessary stress on the shoulder joints and can reduce the effectiveness of the exercise."
        ],
        "breathing_tips": [
            "Inhale as you lower your body towards the elevated surface",
            "Exhale as you push back up to the starting position"
        ]
    },
    {
        "exerciseName": "KNEE PUSH-UPS",
        "thumbnail":"https://cdn.vectorstock.com/i/1000v/17/56/modified-knee-push-ups-exercise-vector-34861756.jpg",
        "URL":"https://www.youtube.com/watch?v=jWxvty2KROs",
        "repition": 10,
        "duration": 0,
        "instructions": "Start in the regular push-up position, then let your knees touch the floor and raise your feet up off the floor.\\n\\nNext push your body up and down.",
        "focus_area": [
            "Chest",
            "Triceps",
            "Shoulders"
        ],
        "common_mistakes": [
            "Placing your hands too wide or too close together can put unnecessary strain on your wrists and elbows. Keep your hands shoulder-width apart and directly under your shoulders.",
            "Allowing your back to sag or liffing your hips too high during Push-ups can put undue stress on your spine and increase the risk of injury. Keep your body in a straight line from head to heels.",
            "It requires the core muscles to be engaged throughout the entire exercise. If the core is not engaged, it can lead to poor form and an ineffective workout.",
            "This places unnecessary stress on the shoulder joints and can reduce the effectiveness of the exercise."
        ],
        "breathing_tips": [
            "Inhale as you lower your body down to the ground",
            "Exhale as you push back up to the starting position"
        ]
    },
    {
        "exerciseName": "PUSH-UPS",
        "thumbnail":"https://www.lyfta.app/_next/image?url=%2Fthumbnails%2F06621201.jpg&w=1920&q=20",
        "URL":"https://www.youtube.com/watch?v=R08gYyypGto",
        "duration": 0,
        "repition": 8,
        "instructions": "Lay prone on the ground with arms supporting your body.\\n\\nKeep your body straight while raising and lowering your body with your arms.\\n\\nThis exercise works the chest, shoulders, triceps, back and legs.",
        "focus_area": [
            "Chest",
            "Triceps",
            "Shoulders"
        ],
        "common_mistakes": [
            "Placing your hands too wide or too close together can put unnecessary strain on your wrists and elbows. Keep your hands shoulder-width apart and directly under your shoulders.",
            "Allowing your back to sag or lifting your hips too high during Push-ups can put undue stress on your spine and increase the risk of injury. Keep your body in a straight line from head to heels.",
            "It requires the core muscles to be engaged throughout the entire exercise. If the core is not engaged, it can lead to poor form and an ineffective workout.",
            "This places unnecessary stress on the shoulder joints and can reduce the effectiveness of the exercise."
        ],
        "breathing_tips": [
            "Inhale as you lower your body towards the ground",
            "Exhale as you push yourself back up",
            "This helps to stabilize your core and maintain proper form"
        ]
    },
    {
        "exerciseName": "WIDE ARM PUSH-UPS",
        "thumbnail":"https://www.lyfta.app/_next/image?url=%2Fthumbnails%2F13111201.jpg&w=1920&q=20",
        "URL":"https://www.youtube.com/watch?v=pQUsUHvyoI0",
        "repition": 8,
        "duration": 0,
        "instructions": "Start in the regular push-up position but with your hands spread wider than your shoulders.\\n\\nThen push your body up and down. Remember to keep your body straight.",
        "focus_area": [
            "Chest",
            "Triceps",
            "Shoulders"
        ],
        "common_mistakes": [
            "This places unnecessary stress on the shoulder joints and can reduce the effectiveness of the exercise.",
            "This can cause the lower back to sag and increase the risk of injury. Tighten your abs to engage the core muscles.",
             "Allowing your back to sag or liffing your hips too high during Push-ups can put undue stress on your spine and increase the risk of injury. Keep your body in a straight line from head to heels.",
            "This can cause strain on the neck and also take away from the effectiveness of the exercise."
        ],
        "breathing_tips": [
            "Inhale as you lower your body towards the ground",
            "Exhale as you push your body back up to the starting position",
            "Taking deep breaths throughout an exercise can increase oxygen flow to your muscles, which helps them work more effeciently and can help enhance your performance."
        ]
    },
    {
        "exerciseName": "COBRA STRETCH",
        "thumbnail":"https://imgs.search.brave.com/8kMD-gVt5EETI948FkrzgUnVnYyp4AjWyy2jQNVvIT0/rs:fit:860:0:0/g:ce/aHR0cHM6Ly93d3cu/eW9nYWpvdXJuYWwu/Y29tL3dwLWNvbnRl/bnQvdXBsb2Fkcy8y/MDE2LzA2L2NvYnJh/LW1vZGlmaWNhdGlv/bnMtMS5qcGc_d2lk/dGg9NzMw",
        "URL":"https://www.youtube.com/watch?v=z21McHHOpAg",
        "duration": 20,
        "repition": 0,
        "instructions": "Lie down on your stomach and bend your elbows with your hands beneath your shoulders.\\n\\nThen push your chest up off the ground as far as possible. Hold this position for seconds.",
        "focus_area": [
            "Abs",
            "Glutes",
            "Hamstrings"
        ],
        "common_mistakes": [
            "One common mistake is over-arching the neck during the exercise, which can lead to neck strain or injury. Instead, keep the neck in a neutral position and focus on engaging the muscles of the upper back to lift the chest off the ground.",
            "Another mistake is using the arms to lift the chest, which can put unnecessary strain on the shoulders and arms. Instead, focus on Using the muscles of the upper back to lift the chest off the ground.",
            "When the upper body is raised, shrugging and tucking in the chest will increase the pressure on the elbow joints and prevent the upper back muscles from being well stretched."
        ],
        "breathing_tips": [
            "Breathe deeply before you begin the stretch can help prepare your body.",
            "Focus on your breath and keep it steady and even throughout the stretch. Holding your breath can cause tension and discomfort."
        ]
    },
    {
        "exerciseName": "CHEST STRETCH",
        "thumbnail":"https://www.lyfta.app/_next/image?url=%2Fthumbnails%2F11671201.jpg&w=1920&q=20",
        "URL":"https://www.youtube.com/watch?v=NS64IgKUyeY",
        "duration": 20,
        "repition": 0,
        "instructions": "Find a doorway, take a lunge position in the doorway with your arms on the doorframe and your elbows a litle lower than your shoulders, then slowly bring your chest forward.\\n\\nHold this position for 30-40 seconds. Then slowly come out of it, bring your arms down and do a couple of shoulder rolls.\\n\\nDon't pull your head forward, and keep your neck relaxed.",
        "focus_area": [
            "Chest",
            "Shoulders",
            "Biceps"
        ],
        "common_mistakes": [
            "Arching the lower back can make the stretch feel deeper. However, this can put unnecessary strain on the lower back and may caUse discomfort or injury.",
            "This can cause tension in the neck and upper back, which can lead to discomfort or injury. It's important to keep your shoulders relaxed and down.",
            "Push yourself properly in a chest stretch but do not overdo it. Overstretching can cause injury and may even make the muscles tighter.",
             "Holding a chest stretch for too long can actually cause the muscles to tighten up again, undoing the work you just did. It's best to hold the stretch for about 15-30 seconds."
        ],
        "breathing_tips": [
            "Inhale deeply and slowly, feeling your chest expand",
            "Exhale slowly, feeling your chest contract"
        ]
    }
]
